<?php
include 'fw/init.php';
$app->header();
?>
<div class="card">
    <div class="card-body">
        <pre>
            09.09.2022
            1) доработан шаблон формы
            08.09.2022
            1) создан компонент формы
            2) добавлен bootstrap
            3) сделаны базовые header, footer
            05.09.2022
            1) созданы классы для работы с компонентами
            2) добавлена автозагрузка компонентов
            3) автозагрузчики вынесены в отдельный файл
            4) создан тип dictionary и наследующие его классы server и request
            02.09.2022
            1) улучшен класс Page
            01.09.2022
            1) создан класс Template
            2) улучшен класс Application, добавлены функции для вывода контента
            31.08.2022
            1) создан трейт singleton
            2) создан класс Page
        </pre>
    </div>
</div>
<?php $app->footer() ?>

